'use strict';

module.exports = [
  {
    value: '社会实践活动',
    label: '社会实践活动',
    children: [
      {
        value: '全国社会实践优秀成果第一作者',
        label: '全国社会实践优秀成果第一作者',
        weight: 15,
      },
      {
        value: '省社会实践优秀成果第一作者',
        label: '省社会实践优秀成果第一作者',
        weight: 12,
      },
      {
        value: '全国社会实践优秀成果其他作者（排名前5）',
        label: '全国社会实践优秀成果其他作者（排名前5）',
        weight: 9,
      },
      {
        value: '校社会实践优秀成果第一作者',
        label: '校社会实践优秀成果第一作者',
        weight: 9,
      },
      {
        value: '省社会实践优秀成果其他作者（排名前5）',
        label: '省社会实践优秀成果其他作者（排名前5）',
        weight: 7,
      },
      {
        value: '院社会实践优秀成果一等奖第一作者',
        label: '院社会实践优秀成果一等奖第一作者',
        weight: 7,
      },
      {
        value: '校大合唱比赛铜奖主要参赛成员',
        label: '校大合唱比赛铜奖主要参赛成员',
        weight: 6,
      },
      {
        value: '校社会实践优秀成果其他作者（排名前5）',
        label: '校社会实践优秀成果其他作者（排名前5）',
        weight: 5,
      },
      {
        value: '院社会实践成果二等奖第一作者',
        label: '院社会实践成果二等奖第一作者',
        weight: 5,
      },
      {
        value: '院社会实践成果一等奖其他作者（排名前3）',
        label: '院社会实践成果一等奖其他作者（排名前3）',
        weight: 4,
      },
      {
        value: '院社会实践成果三等奖第一作者',
        label: '院社会实践成果三等奖第一作者',
        weight: 4,
      },
      {
        value: '院社会实践成果二等奖其他作者（排名前3）',
        label: '院社会实践成果二等奖其他作者（排名前3）',
        weight: 3,
      },
      {
        value: '校、院重大演出主要演员',
        label: '校、院重大演出主要演员',
        weight: 3,
      },
      {
        value: '院社会实践成果三等奖其他作者（排名前3）',
        label: '院社会实践成果三等奖其他作者（排名前3）',
        weight: 2,
      },
      {
        value: '院社会实践合格成果第一作者',
        label: '院社会实践合格成果第一作者',
        weight: 1,
      },
      {
        value: '院社会实践合格成果其他作者（排名前3）',
        label: '院社会实践合格成果其他作者（排名前3）',
        weight: 0.5,
      },
    ],
  },
  {
    value: '文艺活动',
    label: '文艺活动',
    children: [
      {
        value: '校大合唱比赛金奖主要参赛成员',
        label: '校大合唱比赛金奖主要参赛成员',
        weight: 9,
      },
      {
        value: '校大合唱比赛单项奖获得者',
        label: '校大合唱比赛单项奖获得者',
        weight: 8,
      },
      {
        value: '校大合唱比赛银奖主要参赛成员',
        label: '校大合唱比赛银奖主要参赛成员',
        weight: 7,
      },
      {
        value: '个人项目第三名',
        label: '个人项目第三名',
        weight: 6,
      },
      {
        value: '校大合唱比赛金奖普通参赛成员',
        label: '校大合唱比赛金奖普通参赛成员',
        weight: 5,
      },
      {
        value: '校大合唱比赛银奖普通参赛成员',
        label: '校大合唱比赛银奖普通参赛成员',
        weight: 4,
      },
      {
        value: '校大合唱比赛铜奖普通参赛成员',
        label: '校大合唱比赛铜奖普通参赛成员',
        weight: 3,
      },
      {
        value: '个人项目入围名次',
        label: '个人项目入围名次',
        weight: 3,
      },
      {
        value: '院艺术团成员按计划完成学期排练任务',
        label: '院艺术团成员按计划完成学期排练任务',
        weight: 3,
      },
      {
        value: '校、院重大演出普通演员',
        label: '校、院重大演出普通演员',
        weight: 1,
      },
    ],
  },
  {
    value: '体育活动－校重大专项体育竞赛',
    label: '体育活动－校重大专项体育竞赛',
    children: [
      {
        value: '个人项目第一名',
        label: '个人项目第一名',
        weight: 9,
      },
      {
        value: '集体项目第一名队长',
        label: '集体项目第一名队长',
        weight: 9,
      },
      {
        value: '单项奖获得者',
        label: '单项奖获得者',
        weight: 8,
      },
      {
        value: '个人项目第二名',
        label: '个人项目第二名',
        weight: 7,
      },
      {
        value: '集体项目第二名队长',
        label: '集体项目第二名队长',
        weight: 7,
      },
      {
        value: '集体项目第三名队长',
        label: '集体项目第三名队长',
        weight: 6,
      },
      {
        value: '集体项目第一名成员',
        label: '集体项目第一名成员',
        weight: 5,
      },
      {
        value: '集体项目第二名成员',
        label: '集体项目第二名成员',
        weight: 4,
      },
      {
        value: '集体项目第三名成员',
        label: '集体项目第三名成员',
        weight: 3,
      },
      {
        value: '女子 3000m 及以上竞赛项目每完成一项',
        label: '女子 3000m 及以上竞赛项目每完成一项',
        weight: 3,
      },
      {
        value: '集体项目入围名次队长',
        label: '集体项目入围名次队长',
        weight: 3,
      },
      {
        value: '集体项目入围名次成员',
        label: '集体项目入围名次成员',
        weight: 1,
      },
    ],
  },
  {
    value: '体育活动－校田径运动会',
    label: '体育活动－校田径运动会',
    children: [
      {
        value: '男子 5000m 及以上竞赛项目每完成一项	',
        label: '男子 5000m 及以上竞赛项目每完成一项	',
        weight: 3,
      },
      {
        value: '个人竞赛项目每取得 1 分',
        label: '个人竞赛项目每取得 1 分',
        weight: 1,
      },
      {
        value: '娱乐项目每取得 3 分',
        label: '娱乐项目每取得 3 分',
        weight: 1,
      },
      {
        value: '集体竞赛项目每取得 1 分',
        label: '集体竞赛项目每取得 1 分',
        weight: 0.5,
      },
      {
        value: '一般竞赛项目每完成 1 项',
        label: '一般竞赛项目每完成 1 项',
        weight: 0.5,
      },
    ],
  },
];
