'use strict';

module.exports = [
  {
    label: '科技创新竞赛',
    value: '科技创新竞赛',
    children: [
      {
        label: '国际或国家竞赛一等奖个人项目作者',
        value: '国际或国家竞赛一等奖个人项目作者',
        weight: 5,
      },
      {
        label: '国际或国家竞赛一等奖集体项目第一作者',
        value: '国际或国家竞赛一等奖集体项目第一作者',
        weight: 5,
      },
      {
        label: '国际或国家竞赛二等奖个人项目作者',
        value: '国际或国家竞赛二等奖个人项目作者',
        weight: 4,
      },
      {
        label: '国际或国家竞赛二等奖集体项目第一作者',
        value: '国际或国家竞赛二等奖集体项目第一作者',
        weight: 4,
      },
      {
        label: '国际或国家竞赛一等奖集体项目其他作者',
        value: '国际或国家竞赛一等奖集体项目其他作者',
        weight: 3,
      },
      {
        label: '国际或国家竞赛三等奖个人项目作者',
        value: '国际或国家竞赛三等奖个人项目作者',
        weight: 3,
      },
      {
        label: '国际或国家竞赛三等奖集体项目第一作者',
        value: '国际或国家竞赛三等奖集体项目第一作者',
        weight: 3,
      },
      {
        label: '省级竞赛一等奖个人项目作者',
        value: '省级竞赛一等奖个人项目作者',
        weight: 3,
      },
      {
        label: '省级竞赛一等奖集体项目第一作者',
        value: '省级竞赛一等奖集体项目第一作者',
        weight: 3,
      },
      {
        label: '国际或国家竞赛二等奖集体项目其他作者',
        value: '国际或国家竞赛二等奖集体项目其他作者',
        weight: 2,
      },
      {
        label: '省级竞赛二等奖个人项目作者',
        value: '省级竞赛二等奖个人项目作者',
        weight: 2,
      },
      {
        label: '省级竞赛二等奖集体项目第一作者',
        value: '省级竞赛二等奖集体项目第一作者',
        weight: 2,
      },
      {
        label: '国际或国家竞赛三等奖集体项目其他作者',
        value: '国际或国家竞赛三等奖集体项目其他作者',
        weight: 1,
      },
      {
        label: '省级竞赛一等奖集体项目其他作者',
        value: '省级竞赛一等奖集体项目其他作者',
        weight: 1,
      },
      {
        label: '省级竞赛三等奖个人项目作者',
        value: '省级竞赛三等奖个人项目作者',
        weight: 1,
      },
      {
        label: '省级竞赛三等奖集体项目第一作者',
        value: '省级竞赛三等奖集体项目第一作者',
        weight: 1,
      },
      {
        label: '省级竞赛二等奖集体项目其他作者',
        value: '省级竞赛二等奖集体项目其他作者',
        weight: 0.8,
      },
      {
        label: '省级竞赛三等奖集体项目其他作者',
        value: '省级竞赛三等奖集体项目其他作者',
        weight: 0.5,
      },
      {
        label: '校级竞赛一等奖个人项目作者',
        value: '校级竞赛一等奖个人项目作者',
        weight: 0.5,
      },
      {
        label: '校级竞赛一等奖集体项目第一作者',
        value: '校级竞赛一等奖集体项目第一作者',
        weight: 0.5,
      },
      {
        label: '校级竞赛一等奖集体项目其他作者',
        value: '校级竞赛一等奖集体项目其他作者',
        weight: 0.3,
      },
      {
        label: '校级竞赛二、三等奖个人项目作者',
        value: '校级竞赛二、三等奖个人项目作者',
        weight: 0.3,
      },
      {
        label: '校级竞赛二、三等奖集体项目第一作者',
        value: '校级竞赛二、三等奖集体项目第一作者',
        weight: 0.3,
      },
      {
        label: '校级竞赛二、三等奖集体项目其他作者',
        value: '校级竞赛二、三等奖集体项目其他作者',
        weight: 0.2,
      },
      {
        label: '院级竞赛获奖个人项目作者',
        value: '院级竞赛获奖个人项目作者',
        weight: 0.2,
      },
      {
        label: '院级竞赛获奖集体项目第一作者',
        value: '院级竞赛获奖集体项目第一作者',
        weight: 0.2,
      },
      {
        label: '院级竞赛获奖集体项目其他作者',
        value: '院级竞赛获奖集体项目其他作者',
        weight: 0.1,
      },
    ],
  },
  {
    label: '科技创新立项',
    value: '科技创新立项',
    children: [
      {
        label: '校大学生创新性实验计划一等奖个人项目作者',
        value: '校大学生创新性实验计划一等奖个人项目作者',
        weight: 3,
      },
      {
        label: '校大学生创新性实验计划一等奖集体项目第一作者',
        value: '校大学生创新性实验计划一等奖集体项目第一作者',
        weight: 3,
      },
      {
        label: '校大学生创新性实验计划二等奖个人项目作者',
        value: '校大学生创新性实验计划二等奖个人项目作者',
        weight: 2,
      },
      {
        label: '校大学生创新性实验计划二等奖集体项目第一作者',
        value: '校大学生创新性实验计划二等奖集体项目第一作者',
        weight: 2,
      },
      {
        label: '校大学生创新性实验计划一等奖集体项目其他作者',
        value: '校大学生创新性实验计划一等奖集体项目其他作者',
        weight: 1,
      },
      {
        label: '校大学生创新性实验计划三等奖个人项目作者',
        value: '校大学生创新性实验计划三等奖个人项目作者',
        weight: 1,
      },
      {
        label: '校大学生创新性实验计划三等奖集体项目第一作者',
        value: '校大学生创新性实验计划三等奖集体项目第一作者',
        weight: 1,
      },
      {
        label: '校大学生创新性实验计划二等奖集体项目其他作者',
        value: '校大学生创新性实验计划二等奖集体项目其他作者',
        weight: 0.8,
      },
      {
        label: '校大学生创新性实验计划三等奖集体项目其他作者',
        value: '校大学生创新性实验计划三等奖集体项目其他作者',
        weight: 0.5,
      },
      {
        label: '校大学生创新性实验计划结题个人项目作者',
        value: '校大学生创新性实验计划结题个人项目作者',
        weight: 0.3,
      },
      {
        label: '校大学生创新性实验计划结题集体项目第一作者',
        value: '校大学生创新性实验计划结题集体项目第一作者',
        weight: 0.3,
      },
      {
        label: '校大学生创新性实验计划结题集体项目其他作者',
        value: '校大学生创新性实验计划结题集体项目其他作者',
        weight: 0.2,
      },
      {
        label: '院级科技创新立项结题个人项目作者',
        value: '院级科技创新立项结题个人项目作者',
        weight: 0.2,
      },
      {
        label: '院级科技创新立项结题集体项目第一作者',
        value: '院级科技创新立项结题集体项目第一作者',
        weight: 0.2,
      },
      {
        label: '院级科技创新立项结题集体项目其他作者',
        value: '院级科技创新立项结题集体项目其他作者',
        weight: 0.1,
      },
    ],
  },
  {
    label: '科技创新论文专利',
    value: '科技创新论文专利',
    children: [
      {
        label: '发明专利第一作者',
        value: '发明专利第一作者',
        weight: 5,
      },
      {
        label: 'SCI 检索论文第一作者',
        value: 'SCI 检索论文第一作者',
        weight: 5,
      },
      {
        label: '发明专利第二作者',
        value: '发明专利第二作者',
        weight: 3,
      },
      {
        label: 'SCI 检索论文第二作者',
        value: 'SCI 检索论文第二作者',
        weight: 3,
      },
      {
        label: '新型实用专利第一作者',
        value: '新型实用专利第一作者',
        weight: 3,
      },
      {
        label: 'EI, ISTP 检索论文第一作者',
        value: 'EI, ISTP 检索论文第一作者',
        weight: 3,
      },
      {
        label: '新型实用专利第二作者',
        value: '新型实用专利第二作者',
        weight: 2,
      },
      {
        label: 'EI, ISTP 检索论文第二作者',
        value: 'EI, ISTP 检索论文第二作者',
        weight: 2,
      },
      {
        label: '国际会议论文第一作者',
        value: '国际会议论文第一作者',
        weight: 1,
      },
      {
        label: '国内一级刊物论文第一作者',
        value: '国内一级刊物论文第一作者',
        weight: 1,
      },
      {
        label: '国际会议论文第二作者',
        value: '国际会议论文第二作者',
        weight: 0.5,
      },
      {
        label: '国内一级刊物论文第二作者',
        value: '国内一级刊物论文第二作者',
        weight: 0.5,
      },
      {
        label: '核心期刊论文第一作者',
        value: '核心期刊论文第一作者',
        weight: 0.5,
      },
      {
        label: '核心期刊论文第二作者',
        value: '核心期刊论文第二作者',
        weight: 0.3,
      },
      {
        label: '国内会议论文第一作者',
        value: '国内会议论文第一作者',
        weight: 0.2,
      },
      {
        label: '国内会议论文第二作者',
        value: '国内会议论文第二作者',
        weight: 0.1,
      },
    ],
  },
];
